Repository: yshialexandra/Optimizing_LLM_Chinese_Translation_through_Syntactic_Feature_Extraction_and_Representation_Editing
Catalog: yshibachlorpaper/Yiyan_tmx/F31B.tmx
Source language: en_us
Languages: zh_cn

source: The saddle saga: highs and lows in France
zh_cn: 单车传奇：在法国的利弊种种

source: Cycling in France is very different from cycling in the UK.
zh_cn: 在法国骑车和在英国有很大的不同。

source: In France, a passing motorist would sooner hit an oncoming car than stray too close to a cyclist, and they always wait patiently to overtake ¨C a far cry from the cavalier attitude of some British motorists who panic when they see a bicycle and seem to feel the urge to overtake at all costs.
zh_cn: 在法国，开车人宁愿与其它汽车靠得更近，也不愿意太靠近一个骑车人，而且他们总是很有耐心地等待合适的时机来超车。这种骑士风度是英国司机所不具备的，英国的司机们看见自行车会感到很恐慌，并且会想方设法去超越每一辆自行车。

source: Perhaps this is due to the French national obsession with cycling, but it made it a pleasure passing through north-eastern France's immaculate countryside.
zh_cn: 也许这是法国人喜爱自行车运动的缘故，但这也使我们经过法国东北部美丽乡村的旅途变得轻松愉快。

source: I was struck by the beauty of each French village we came across: every lawn was pristine, colourful flowers were everywhere, and yet we rarely saw any people.
zh_cn: 我们每经过一个村庄时，我都会被它们的美丽所打动——每一片草地都清新宜人，到处盛开着色彩缤纷的鲜花。

source: Some villages were like perfectly preserved ghost towns.
zh_cn: 然而我们却很少看到有人，有些村庄像是保存得完美无缺的鬼镇。

source: We made good progress, and were soon heading west where, unbeknown to us, there was a heatwave ¨C temperatures were predicted to reach 102?F in the shade.
zh_cn: 我们的骑行速度很快，不久就转为朝西的方向，但不知道那里正经受着热浪的袭击——天气预报说在阴影处的温度就可高达102华氏度。

source: Riding an 88lb bike in the direct glare of the blazing sun - especially with our un-acclimatised English skin ¨C became foolhardy.
zh_cn: 在炽热阳光的直接照射下骑着载重88磅的自行车不是一件聪明的事情，特别是我们有着不适应此地天气的英国皮肤。

source: So we began to rise early and enjoy the cool of the early morning, followed by taking long siestas to escape the oppressive heat in the middle of the day, and returning to the saddle in the afternoon as the heat subsided.
zh_cn: 所以我们开始每天早早起身，来充分利用清晨的凉爽时间。然后在中午的时候美美睡上一觉午觉以避开日中的酷热，直到下午炎热消退的时候我们再重新回到鞍座上。

source: Our new routine worked well, except on one day when we rose late and decided to cycle in the midday sun.
zh_cn: 我们的新作息方法很有效，除了有一天我们起身晚了，所以决定在中午的阳光下也来骑上一段。

source: The action of cycling generated a deceptively cooling breeze and it was not until we stopped at 6pm that we realised how dazed and drained we were.
zh_cn: 骑车行进时会产生一股颇有欺骗性的凉风，直到下午6点停下车来，我们才发现自己累得够呛。

source: Spotting a thermometer in the shade, I was shocked to see it read 88?F. I don't know exactly how hot it had been at midday, but when a passing motorist lent out of the window and put his finger to his temple, we should have taken the hint.
zh_cn: 我看到在阴凉处有一只温度计，惊奇地发现上面的读数为华氏88度，我不知道在中午的时候会是怎样的温度。当时有一位司机从车窗伸出头来，他用手指指着自己的太阳穴，我们应该懂得他的意思了。

source: Passing through France on our way to Luxembourg, we came across dozens of war graves dotted around the countryside.
zh_cn: 在经过法国前往卢森堡的路上，我们看见在乡村里点缀着不少战争墓地。

source: We should have expected them, and yet they came as a surprise and made us reflect on what had occurred not that long ago in the fields we were passing.
zh_cn: 我们本来应该想到会看见这些墓地，但它们仍使我们感到意外，并让我们想到在不太久的以前，在我们经过的这片田野上发生过怎样的事情。

source: The Commonwealth War Graves Commission constructed and maintains 2,500 cemeteries paying tribute to the 1.7 million men and women in the Commonwealth forces who died during the two World Wars.
zh_cn: 联邦战争墓地委员会建起和维护着2,500个墓园，在这些墓园中长眠着在两次世界大战中丧身的一百七十万联邦军队的男女军人。

source: Today, the graves act as a stark reminder of the past and a useful warning to future generations.
zh_cn: 今天这些墓园作为对过去历史的提醒令人触目惊心，对后人起着警示的作用。

source: The terrain became increasingly tough as we approached the Ardennes region in France, the climbs becoming longer and steeper.
zh_cn: 当我们来到法国阿登地区时，路变得越来越难走，上坡的路变得更长也更陡了。

source: But as we dropped down to Boullion in Belgium, we were rewarded with mile after mile of endless switchbacks through lush forest; I couldn't help but grin from ear to ear.
zh_cn: 但是当下坡来到比利时的博莱昂时，我们得到的回报是在茂密的森林中骑过了无数个折弯，我不由得笑得合不拢嘴。

source: We decided to celebrate with Nutella and marshmallow sandwiches that night, and pondered what the road ahead might hold for us: perhaps our first shower in a week, or maybe even a hot meal.
zh_cn: 那天晚上我们决定用加巧克力酱和蜜饯的三明治来犒劳自己，同时也考虑了一下后面的旅程。一个星期以来我们第一次洗了澡，或许也是第一次吃到了热汤热水的饭菜。
